#include <stdio.h>

int main() {

	//типізація даних, масив на 3 елементи і для циклу, так зміна для перевірки рівності чисел
	int array[3], i, equal = 0;

	//вивести дані про те що потрібно зробити користувачу
	printf("Enter 3 number:\n");


	//ввід десяти єлементів масиву
	for (i = 0; i < 3; i++) {

		scanf_s("%d", &array[i]);

	}

	//перевірка чи всі елементи рівні 
	//звичайно можно просто перевірити чи рівні елементи між собою просто через умову
	//але коли елементів не 3, а до прикладу 100, перевірка циклом на багато зручніша 
	for (i = 0; i < 2; i++) {

		if (array[i] != array[i + 1]) {

			equal += 1;

		}

	}


	//якщо всі 3 цифри рівні
	if (!equal) {

		//вивсести цифри рівні
		printf("Numbers are equal\n");

	}

	//інакше
	else {

		//типізація мінамальне значення (надати значення першого єлементу масиву)
		int min_array = array[0];


		//знаходження найменшого значення в масиві
		for (i = 0; i < 3; i++) {

			//перевірка чи менше i-ий елемента ніж значення в зміній
			if (array[i] < min_array) {

				//надати зміній мінімальне значення нового значення
				min_array = array[i];

			}

		}

		//вивести результат (мінімальне значення)
		printf("Min:%d\n", min_array);

	}


	//повернути 0
	return 0;
}